#pragma once

const char* OUC_WELCOME_CONTENT = R"(
[38;5;45m
  ___  _   _  ____ ____                    ____  _
 / _ \| | | |/ ___/ ___| _   _ _ ____   __/ ___|(_)_ __ ___  
| | | | | | | |   \___ \| | | | '__\ \ / /\___ \| | '_ ` _ \ 
| |_| | |_| | |___ ___) | |_| | |   \ V /  ___) | | | | | | |
 \___/ \___/ \____|____/ \__,_|_|    \_/  |____/|_|_| |_| |_|
                                                             
╔════════════════════════════════════════════════════════════╗
║           ———==== OUC 生存大冒险 v0.1.0  ====———           ║
╚════════════════════════════════════════════════════════════╝
[0m
[38;5;8m
================================== Hint ======================================
欢迎来到 OUC 生存大冒险，本游戏支持 Linux(GNU)、Win10/11(MinGW/VS2022),请确保终
端支持 ANSI 转义，可通过检查上面的 LOGO 是否变色来确认。

请确保 prompt 处于项目配置文件根目录下，结构示例：
.
├── docs
├── maps
├── static
├── saves       # (首次运行时该目录不存在)
└── README.md

请调整字体大小至 12px 以获得最佳游戏体验...
Github: https://github.com/JEB-him/MUD-Game[0m
)";
